src/test/resources/artillery/io-test.yaml
config:
  target: "http://localhost:1882"
  phases:
    - duration: 333
      arrivalRate: 3
      name: Warm up
  payload:
    path: "../test-data/ratings_test_1k.csv"
    fields:
      - "content"
  scenarios:
    - name: "just get content"
      flow:
        - post:
            url: "/posts"
            json:
              content: "{{ content }}"